"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.MockData = void 0;
class MockData {
    constructor() {
        this.technologyCategories = [
            {
                name: "Front-end часть"
            }, {
                name: "Back-end часть"
            }, {
                name: "Публикация"
            }, {
                name: "Администрирование"
            },
        ];
        this.technologies = [
            {
                meaning: "Графический редактор (разработка прототипа)",
                technology: "Adobe Illustrator",
                icon: "https://avatars.mds.yandex.net/get-mpic/4944925/img_id3714196473941251718.jpeg/orig",
                experience: "2",
                technologyId: 1
            }, {
                meaning: "Графический редактор (разработка прототипа)",
                technology: "Adobe Photoshop",
                icon: "https://avatars.mds.yandex.net/get-mpic/4944925/img_id3714196473941251718.jpeg/orig",
                experience: "2",
                technologyId: 1
            }, {
                meaning: "Графический редактор (разработка прототипа)",
                technology: "Adobe XD",
                icon: "https://avatars.mds.yandex.net/get-mpic/4944925/img_id3714196473941251718.jpeg/orig",
                experience: "2",
                technologyId: 1
            }, {
                meaning: "Графический редактор (разработка прототипа)",
                technology: "MySQL",
                icon: "https://avatars.mds.yandex.net/get-mpic/4944925/img_id3714196473941251718.jpeg/orig",
                experience: "3",
                technologyId: 2
            }
        ];
        this.articles = [
            {
                title: "Что такое фирменный стиль бренда и почему он важен?",
                description: "Объясняем из чего складывается уникальный фирменный стиль бренда.",
                text: "Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.",
                timeReading: "3"
            }, {
                title: "Что такое фирменный стиль бренда и почему он важен?",
                description: "Объясняем из чего складывается уникальный фирменный стиль бренда.",
                text: "Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.",
                timeReading: "3"
            }, {
                title: "Что такое фирменный стиль бренда и почему он важен?",
                description: "Объясняем из чего складывается уникальный фирменный стиль бренда.",
                text: "Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.",
                timeReading: "3"
            }, {
                title: "Что такое фирменный стиль бренда и почему он важен?",
                description: "Объясняем из чего складывается уникальный фирменный стиль бренда.",
                text: "Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.",
                timeReading: "3"
            }, {
                title: "Что такое фирменный стиль бренда и почему он важен?",
                description: "Объясняем из чего складывается уникальный фирменный стиль бренда.",
                text: "Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.Объясняем из чего складывается уникальный фирменный стиль бренда.",
                timeReading: "3"
            },
        ];
    }
    getTechnologyCategories() {
        return this.technologyCategories;
    }
    getTechnologies() {
        return this.technologies;
    }
    getArticles() {
        return this.articles;
    }
}
exports.MockData = MockData;
//# sourceMappingURL=mock-data.js.map